{
  "thread_id": "1oh5mdy",
  "subreddit": "Debate",
  "title": "How to deal with disrespectful opponents?",
  "utterances": [
    {
      "id": "U1",
      "speaker_id": "S1",
      "parent_id": null,
      "author": "Quick_Upstairs1832",
      "text": "How to deal with disrespectful opponents?\n\nI joined speech and debate this year and I'm doing public forum debate. It was my first tournament yesterday and somehow, we went 5-0 and we broke and won octafinals as well.\n\nBut, when we got to quarterfinals I fumbled my rebuttal a bit (my points were good but i struggled to get them out smoothly) and recovered a good amount in final focus. We did end up losing that round 2-1, however, my friends who were spectators told me that our opponents were supposedly laughing and rolling their eyes during my final focus.\n\nOne of our debate captains told me that we could do something about that because it's a form of disrespect and not proper debate. I was wondering if anyone who's more experienced could tell me what I should've done in that situation?\n\nLike would I tell the judges post-debate or what?",
      "depth": 0
    },
    {
      "id": "U2",
      "speaker_id": "S2",
      "parent_id": "U1",
      "author": "Lloser__",
      "text": "I’ve only done PF for like 9 months but this is going to happen everywhere; you just gotta “suck it up”. From a local varsity tournament when I first began all the way to Yale quarters, this is just gonna be something you gotta accept.",
      "depth": 1
    },
    {
      "id": "U3",
      "speaker_id": "S1",
      "parent_id": "U2",
      "author": "Quick_Upstairs1832",
      "text": "alr thx",
      "depth": 2
    },
    {
      "id": "U4",
      "speaker_id": "S3",
      "parent_id": "U1",
      "author": "FlingbatMagoo",
      "text": "I’m a judge, and we see what’s going on. It’s just a matter of how bad it is relative to everything else in the round. But even if I give a disrespectful opponent a win, I’ll mention it on the ballot. I’d suggest you just stay classy and do your best!\n\nWhen I was in high school doing LD, as a senior I was on a solid winning streak and I remember in a preliminary round I hit a really inexperienced debater who was bad. His arguments were basic and he was struggling. I just did my thing, and the judge awarded my opponent the win, and on the ballot he said I was over-confident and dismissive of my opponent’s points. It stuck with me (this was almost 30 years ago and I still remember it), and after that I made sure to be as gracious as possible no matter who I was debating. A good life lesson.",
      "depth": 1
    },
    {
      "id": "U5",
      "speaker_id": "S1",
      "parent_id": "U4",
      "author": "Quick_Upstairs1832",
      "text": "dang so ettiquette still matters",
      "depth": 2
    },
    {
      "id": "U6",
      "speaker_id": "S4",
      "parent_id": "U5",
      "author": "Boring_Objective1218",
      "text": "I would hope so, etiquette is the only way debate doesn’t become a screaming match btw aggressive types by the end of a round&amp; there’s enough of that showboating happening irl",
      "depth": 3
    },
    {
      "id": "U7",
      "speaker_id": "S5",
      "parent_id": "U1",
      "author": "bluntpencil2001",
      "text": "It's better to learn to take it on the chin. The judges will notice, and dock them points for it, and refer to it in their feedback. Their coach will then see this.\n\nIf they show disrespect before the end, you can maybe drop in a passive aggressive mention of it in your summary or final focus,\n\n\"Our opponents missed our point on free trade, probably because they were too busy laughing instead of listening, so you should consider that a dropped contention and recognise our win there.\"\n\nComplaining in an attempt to get a win because of ill discipline on the part of your opponents will not be viewed positively, generally speaking. They'll ask the judges, who will say they didn't see it or that it wasn't as bad as you (or your teammates) said. Use their ill discipline to your advantage instead.\n\nAlso, don't let it get to you. Many teams use... let's say confident looking body language as a strategy. Speak to your opponents both before and after debates (especially if it gets super heated) and say something positive. That always gets good feedback from judges to coaches, and often reveals that a lot of the apparent negativity or aggression you've seen is part of an act or strategy.\n\n-\n\nI've seen a debater physically tower over one of my own teams during cross after they struggled to find their evidence quickly enough. \n\n\"Let me see your laptop, it'll save time.\" \n\n&lt;Girl proceeds to walk over, tower over a seated opponent, who looked terrified&gt;\n\nI thought it was an excellent, if risky, way to shake an opponent. After the debate was over, she was super nice and full of positive things to say, even though she was attempting to fray the nerves of her opponent. Obviously an act, from a kid that's pleasant in other situations.\n\nMy team that were affected by this made a point of learning from it, and went on to plan for such eventualities and strategies being used against them. They didn't get upset about it but worked out what to do to counter it.",
      "depth": 1
    },
    {
      "id": "U8",
      "speaker_id": "S6",
      "parent_id": "U7",
      "author": "horsebycommittee",
      "text": "&gt; If they show disrespect before the end, you can maybe drop in a passive aggressive mention of it in your summary or final focus,\n\n&gt; \"Our opponents missed our point on free trade, probably because they were too busy laughing instead of listening, so you should consider that a dropped contention and recognise our win there.\"\n\nI wouldn't do this. Best case is that the judge already noticed this behavior and took it into account and/or will report it themself, so your piling on looks petty and in the vein of a sore winner. Worst case, you've misinterpreted your opponent's behavior and the judge thinks it was innocuous/reasonable, so you are being vindictive and whiny without any basis. In the middle, the judge didn't see what your opponents did but you calling it out is still whiny because it's not part of the merits of what you're arguing and you have no idea whether they were paying attention to your speech or not. \n\nIf you have a strong point that your opponent drops, just call out the drop. Don't waste your time speculating *why* your opponent dropped it, especially if you'd be delivering insults/personal attacks to do so. This isn't a roast.",
      "depth": 2
    },
    {
      "id": "U9",
      "speaker_id": "S7",
      "parent_id": "U8",
      "author": "StinkyCheeseWomxn",
      "text": "Agreed - judges recognize petty and don't appreciate it. It is not strategic to go low when they do. Focus on your own preparation and integrity and recognize it is not your role to police the poor behavior of your opponents. If your opponents are behaving rudely, that is a gift to you, and all you have to do to receive that gift is to be authentically respectful and demonstrate excellence and integrity. Judges will almost always dock their speaks and give you a little more grace. It is possible to still lose the round on the flow, but over time, this is the way. Really good teams don't engage in this behavior - they just win the round and earn respect.",
      "depth": 3
    },
    {
      "id": "U10",
      "speaker_id": "S5",
      "parent_id": "U8",
      "author": "bluntpencil2001",
      "text": "Upvoting despite disagreeing: good point made.\n\nSure, but I'd say it depends on the judge. If I'm judging, I don't mind going for the throat like this. \n\nIn addition, I always think it's better to err on the side of aggression over the opposite.",
      "depth": 3
    },
    {
      "id": "U11",
      "speaker_id": "S1",
      "parent_id": "U7",
      "author": "Quick_Upstairs1832",
      "text": "alr thx a lot this helps me a lot",
      "depth": 2
    },
    {
      "id": "U12",
      "speaker_id": "S8",
      "parent_id": "U1",
      "author": "teb311",
      "text": "Unfortunately, debate has an abundance of over-confident jerks. It’s not always easy, but deciding to care less about that kind of thing is a skill you can develop and it will serve you well in this activity and in life. Also, feel free to let it fuel you a little. Next time you see this team in out-rounds make it a 3-0 in your favor, and that will be all the revenge you need. \n\nThe judges likely saw the behavior, and some of them may have noted it in their ballots. Also, coaches talk. I had a student tell me one of their opponents was playing video games during one of her speeches in a similarly disrespectful manner (I’ve already won, I can check out now). I told their coach, he rolled his eyes and told me it’s an ongoing problem with this student, I imagine the student got a bit of a lecture. So tell your coach about disrespectful behavior.\n\nI very much doubt the tournament would change a result or DQ a competitor for the behavior you described though.",
      "depth": 1
    },
    {
      "id": "U13",
      "speaker_id": "S7",
      "parent_id": "U1",
      "author": "StinkyCheeseWomxn",
      "text": "Ideally, your judges should see their behavior and address it on the ballot so that their coach can address it as well.",
      "depth": 1
    },
    {
      "id": "U14",
      "speaker_id": "S9",
      "parent_id": "U1",
      "author": "busybody_nightowl",
      "text": "I’ve had opponents who made fun of my teammate’s stutter any my partner’s hearing loss. If it’s something that egregious (making fun of a person’s disability, gender, race, religion, sexual orientation, etc) you can say something in round.\n\nOtherwise, smile, let it roll off your back, and just do your best. The judges will usually see it. Otherwise, it doesn’t really matter at the end of the day. Some people are jerks. Try not to let it get to you and tell your coach if it’s really bad.",
      "depth": 1
    },
    {
      "id": "U15",
      "speaker_id": "S10",
      "parent_id": "U1",
      "author": "Mereel13",
      "text": "I would not wait until post debate. I would run an argument in round about your opponents behavior that is akin to like a dirty word kritik or something like that. If the behavior is bad enough/the argument is decent, I would drop the opposing team for their behavior.\n\n  \nI will say—it partly depends on the conduct. I would not condone eye rolling, but I'm going to have a very hard time policing that as your judge and I feel like it shouldn't impact you that much. Whereas if they are laughing and interrupting your speech, I would look very unfavorably upon them for it.",
      "depth": 1
    },
    {
      "id": "U16",
      "speaker_id": "S11",
      "parent_id": "U1",
      "author": "Nervous_Leek7021",
      "text": "I once went against a team who said \"my opponent has presented baseless and easy to disprove arguments\". Shit was kinda crazy, we lost tho.",
      "depth": 1
    },
    {
      "id": "U17",
      "speaker_id": "S12",
      "parent_id": "U1",
      "author": "The_Empress",
      "text": "I’m a judge and I notice and will absolutely make a comment on the ballot detailing the behavior so the coach can deal with it appropriately. In prelims, I will also tank speaks for blatantly disrespectful behavior. This is detailed in my paradigms online and I always mention it when I verbally provide my paradigms at the beginning of the debate. Watching people laugh and be rude is somewhere between cringey and very uncomfortable for me. \n\nIf it’s disruptive - like I can hear the laughing not just see it, I will say something between speeches.\n\nThis is definitely a case of bite your tongue and let your debating speak for itself. Frankly, it’s always pretty mediocre debaters that are assholes like this.",
      "depth": 1
    },
    {
      "id": "U18",
      "speaker_id": "S13",
      "parent_id": "U1",
      "author": "Smooth-Yak2073",
      "text": "Theory!",
      "depth": 1
    },
    {
      "id": "U19",
      "speaker_id": "S14",
      "parent_id": "U1",
      "author": "Hphj1",
      "text": "If you're intelligent—and I mean very intelligent—you can agree with your opponents and then take actions that force them to contradict themselves. Generally, these types of people believe they're always right, and making them contradict themselves is the best approach. If they only listen to themselves, making them listen and realize that what they said was wrong will frustrate them. Personally, I use this tactic, and it works for me. What I often use to generate these contradictions are logical and coherent questions, especially those related to their argument. You also have to make sure their argument is flawed; otherwise, you'll be the only one who suffers.",
      "depth": 1
    },
    {
      "id": "U20",
      "speaker_id": "S15",
      "parent_id": "U1",
      "author": "Still-Assumption-647",
      "text": "You could try and run a K so the judge knows.",
      "depth": 1
    },
    {
      "id": "U21",
      "speaker_id": "S16",
      "parent_id": "U1",
      "author": "Otherwise_Bobcat_402",
      "text": "Basically. You're the best person in the room. No matter what happens, be the kindest. In my first year of PFD, I learned that people will do that, and when it happens and you notice that, don't let it get to you. It depends on the situation, but if they attack you personally in a speech, tell them off and tell the judge that it isn't affective in the round. Unless they're specifically relating it to the attack, then defend as usual. \nIf you don't notice it then it's up to the judge to see if they're mean. Sometimes they're just the better debaters.",
      "depth": 1
    },
    {
      "id": "U22",
      "speaker_id": "S17",
      "parent_id": "U1",
      "author": "Debably",
      "text": "First off, congrats on going 5-0 and making it to quarters in your first tournament! That's genuinely impressive.\n\nThe advice here about judges noticing is spot on. What I'd add is that this experience, while frustrating, actually makes you stronger. Learning to deliver your arguments clearly when opponents are trying to throw you off is a valuable skill that'll serve you well in future rounds.\n\nThe fact that you recovered in final focus and still delivered your points shows you've got good composure under pressure. Many debaters would have completely fallen apart after blanking during rebuttal, but you pushed through and finished the round.\n\nAlso worth remembering that teams who resort to obvious disrespect during your speech usually do it because they're worried about their own position. Confident teams with strong arguments don't need to rely on intimidation tactics.\n\nNext time this happens, use it as fuel. Think \"they're worried enough about what I'm saying that they're trying to put me off\" rather than \"they think I'm rubbish.\" It's actually a weird sort of compliment when you think about it that way.\n\nKeep your head up and keep debating. The fact that you're asking these questions shows you're thinking about improvement, which is exactly the right mindset.",
      "depth": 1
    },
    {
      "id": "U23",
      "speaker_id": "S18",
      "parent_id": "U1",
      "author": "trashboat694",
      "text": "Match their energy if they're competent. Also point out mistakes on the line by line and say things \"Be rude isn't an argument, they've conceded \"x\" argument\" or just sass them back in crossfire.",
      "depth": 1
    },
    {
      "id": "U24",
      "speaker_id": "S19",
      "parent_id": "U1",
      "author": "PlayfulPassion10",
      "text": "you would ask your coach to protest to tabroom.",
      "depth": 1
    },
    {
      "id": "U25",
      "speaker_id": "S1",
      "parent_id": "U24",
      "author": "Quick_Upstairs1832",
      "text": "what would tabroom do? sorry if it's a dumb question i rly don't know much",
      "depth": 2
    },
    {
      "id": "U26",
      "speaker_id": "S7",
      "parent_id": "U25",
      "author": "StinkyCheeseWomxn",
      "text": "Tabroom cannot \"give you a win\" based on the loser's perceived experience of rudeness in their opponent. Sometimes your coach or the judge can have a private chat with their coach, but eyerollling and silent laughter is not an issue where tabroom can overturn the decision of the judge in the room.",
      "depth": 3
    },
    {
      "id": "U27",
      "speaker_id": "S20",
      "parent_id": "U26",
      "author": "SolarxPvP",
      "text": "Yeah, it's frustrating when opponents act that way, but unfortunately, judges usually don't intervene for that kind of behavior. Focus on your own performance instead. If it really bothers you, maybe mention it to your coach for future rounds, but don't let it distract you from improving your skills!",
      "depth": 4
    },
    {
      "id": "U28",
      "speaker_id": "S6",
      "parent_id": "U25",
      "author": "horsebycommittee",
      "text": "\"Tab room\" is the nickname for the tournament's headquarters. (Used to be where the actual ballot tabulation occurred, now that's almost all electronic, so tabbing can happen anywhere in the building.) It's where the Tournament Director and the other people in charge of running the tournament will be found. (In general, competitors should not bring complaints to tab, they should go through the coach.)\n\nIf tab is alerted to a violation of the rules, then they can investigate and take a variety of actions that are not available to the judge in the room. Tab can adjust speaker points, award forfeit wins/losses, reassign competitors or judges, disqualify competitors, and more.\n\nNow for what you've described here, I would expect tab to -- at *most* -- give a verbal reprimand to the other team and a brief lecture on decorum in the round. More likely is that tab would either ignore the complaint or pass it along to the other team's coach to handle.",
      "depth": 3
    },
    {
      "id": "U29",
      "speaker_id": "S21",
      "parent_id": "U28",
      "author": "Scratchlax",
      "text": "&gt; tab would either ignore the complaint or pass it along to the other team's coach to handle.\n\nThat's how I would handle it. \"Bob, your kids are being jerks. Code 314. Fix it.\"",
      "depth": 4
    },
    {
      "id": "U30",
      "speaker_id": "S19",
      "parent_id": "U25",
      "author": "PlayfulPassion10",
      "text": "they would give u the win",
      "depth": 3
    },
    {
      "id": "U31",
      "speaker_id": "S22",
      "parent_id": "U30",
      "author": "thirtyonem",
      "text": "Lmao no wtf",
      "depth": 4
    },
    {
      "id": "U32",
      "speaker_id": "S23",
      "parent_id": "U30",
      "author": "Tough_Fortune_3206",
      "text": "no they would absolutely not lol",
      "depth": 4
    }
  ]
}