{
  "thread_id": "1ozh22a",
  "subreddit": "Debate",
  "title": "How to deal with outrageous motions?",
  "utterances": [
    {
      "id": "U1",
      "speaker_id": "S1",
      "parent_id": null,
      "author": "TheMysteriousMan2349",
      "text": "How to deal with outrageous motions?\n\nIn practice rounds, my club coach gave the motion 'THW make rape legal.' I was on prop side and of course I got destroyed! How are you even supposed to argue this topic?\n\nThe coach said something about the effect on society that rape has, but I really do not understand it. I would be grateful if someone could help me understand if this motion really can be argued or is just absolutely unfair to prop side.",
      "depth": 0
    },
    {
      "id": "U2",
      "speaker_id": "S2",
      "parent_id": "U1",
      "author": "polio23",
      "text": "I want to be 100% clear: if an administrator at your school knew that your coach had students debate this topic they would be at significant risk of losing their job. This is wildly inappropriate and any adult who works with young people should know that.",
      "depth": 1
    },
    {
      "id": "U3",
      "speaker_id": "S3",
      "parent_id": "U2",
      "author": "dirty_smart_man",
      "text": "100% correct.  When I saw this post, the best that describes the scenario is cringe (and that's giving the benefit that the coach doesn't have some untoward motives).",
      "depth": 2
    },
    {
      "id": "U4",
      "speaker_id": "S4",
      "parent_id": "U2",
      "author": "joelgratz",
      "text": "Better said than my response. Thank you.",
      "depth": 2
    },
    {
      "id": "U5",
      "speaker_id": "S5",
      "parent_id": "U1",
      "author": "horsebycommittee",
      "text": "Two things are true. 1. There can be value in using lopsided resolutions in a practice setting when accompanied by significant guidance/teaching from the coach. 2. *This* resolution's weakness is that is it offensive and inappropriate, not that it is one-sided.\n\nI don't know if this is simply an example of a coach exercising extremely poor judgment in selecting a practice topic or if it's part of a pattern of something more troubling, but I would (at minimum) inform your parents about this assigned topic and find a way to alert a school administrator. Someone in a position of authority needs to inform the coach that this isn't okay and must never be repeated.",
      "depth": 1
    },
    {
      "id": "U6",
      "speaker_id": "S6",
      "parent_id": "U5",
      "author": "MammothCredit7310",
      "text": "If it's not \"one-sided\", what's the other side?",
      "depth": 2
    },
    {
      "id": "U7",
      "speaker_id": "S7",
      "parent_id": "U6",
      "author": "ddaem",
      "text": "You might want to re read the comment you are replying to.",
      "depth": 3
    },
    {
      "id": "U8",
      "speaker_id": "S5",
      "parent_id": "U6",
      "author": "horsebycommittee",
      "text": "You misread. This resolution *is* one-sided, but that one-sidedness is not where the problem is.",
      "depth": 3
    },
    {
      "id": "U9",
      "speaker_id": "S6",
      "parent_id": "U8",
      "author": "MammothCredit7310",
      "text": "Okay, got it.",
      "depth": 4
    },
    {
      "id": "U10",
      "speaker_id": "S8",
      "parent_id": "U1",
      "author": "No-Complaint7131",
      "text": "There is abs zero debate to this, it’s unacceptable and it was not ok that ur coach made u debate this.",
      "depth": 1
    },
    {
      "id": "U11",
      "speaker_id": "S9",
      "parent_id": "U1",
      "author": "webbersdb8academy",
      "text": "I am a professional educator and administrator, as some of the others on here may be as well. \n\nThis is unquestionably inappropriate and potentially career ending for any educator. It violates the main principles of safeguarding and should be reported. \n\nI know you may not feel comfortable reporting this but you should then reconsider your relationship and contact with this person for your own safety.",
      "depth": 1
    },
    {
      "id": "U12",
      "speaker_id": "S10",
      "parent_id": "U1",
      "author": "lddebatee",
      "text": "I would report this coach. Unacceptable",
      "depth": 1
    },
    {
      "id": "U13",
      "speaker_id": "S11",
      "parent_id": "U1",
      "author": "pavelysnotekapret",
      "text": "Echoing the other points, absolutely report this coach; they should not be working with children at all",
      "depth": 1
    },
    {
      "id": "U14",
      "speaker_id": "S12",
      "parent_id": "U1",
      "author": "Jwarr",
      "text": "You should report this coach to an administrator and if they are not an employee of a school, you should stop working with them.",
      "depth": 1
    },
    {
      "id": "U15",
      "speaker_id": "S4",
      "parent_id": "U1",
      "author": "joelgratz",
      "text": " Honestly I’m troubled that a coach would put this proposition out there. Anything can be argued and some like to argue anything. But a coach suggesting that topic is a bit concerning and I have to wonder about their motivations.",
      "depth": 1
    },
    {
      "id": "U16",
      "speaker_id": "S13",
      "parent_id": "U1",
      "author": "ETphonehome3876",
      "text": "Ok everyone else makes a good point about how this is an outrageous topic and bad choice on the coaches part outside of this.\n\nBut to address your main question of how to argue something like this, I would think about trying to attack underlying assumptions/deeper questions.\n\nAre we actually capable of giving consent? (Psychology about how all humans are crazy)\n\nIs it the governments place to regulate rape?\n\nDo human rights exist?\n\nEtc.\n\nThat said though, this is a bad example because, well the one sided topic is offensive and inappropriate, not extactly groundless",
      "depth": 1
    },
    {
      "id": "U17",
      "speaker_id": "S14",
      "parent_id": "U1",
      "author": "Repulsive_Meaning717",
      "text": "lowk weird as fuck to do with a bunch of kids.",
      "depth": 1
    },
    {
      "id": "U18",
      "speaker_id": "S15",
      "parent_id": "U1",
      "author": "Darthmalak135",
      "text": "THW doesn't mean THS. Do a fact and talk about how rape is a key strategy of a certain org by defining this house as Hamas. Or say that rape is the term used to describe the colonization of africa and say this house is china, and that the BRI is a new form of colonialism. Use definitions to your advantage and run a fact debate saying its not about good or bad, but what will or wont. Furthermore, you can argue that it's so outrageous to argue for rape that the framer must be arguing for a fact, etc.\n\n  \nThat doesn't mean what your coach did was acceptable. I would talk to admin if it made people uncomfortable because the spirit of debate is education and accessibility.",
      "depth": 1
    }
  ]
}