{
  "thread_id": "fklov0",
  "subreddit": "arguments",
  "title": "Are zombies human?",
  "utterances": [
    {
      "id": "U1",
      "speaker_id": "S1",
      "parent_id": null,
      "author": "24hourcinderella",
      "text": "Are zombies human?\n\nI was playing Dead Island with my brother. He tried saying that zombies are still human even after they turn. I disagreed and said they were no longer human when they turn. His points were that they didn't change much physically, were basically undead humans, and that they were the same but insane. My points were that if they were human then you wouldn't need the word zombie, the fact that they change so much mentally, humans don't act that way unless you've gone mad, and the fact that you aren't the same anymore after turning. If you could offer new points, give your opinion, or say who is right it would be appreciated.",
      "depth": 0
    },
    {
      "id": "U2",
      "speaker_id": "S2",
      "parent_id": "U1",
      "author": "madmatias",
      "text": "Well if a banana rots is it still a banana?",
      "depth": 1
    },
    {
      "id": "U3",
      "speaker_id": "S1",
      "parent_id": "U2",
      "author": "24hourcinderella",
      "text": "That's totally different. A banana doesn't undergo much of a change. With zombies they completely become monsters that crave human flesh.",
      "depth": 2
    },
    {
      "id": "U4",
      "speaker_id": "S2",
      "parent_id": "U3",
      "author": "madmatias",
      "text": "Okay well the way that zombies work is an infection, right? So if a human gets bitten by a zombie, the person gets the virus. So I think that if we think about it from a scientific viewpoint, there has never been a virus that could turn the infected animals species.",
      "depth": 3
    },
    {
      "id": "U5",
      "speaker_id": "S1",
      "parent_id": "U4",
      "author": "24hourcinderella",
      "text": "Yes but nothing that can take multiple bullets in the chest and still stand should be considered human.",
      "depth": 4
    },
    {
      "id": "U6",
      "speaker_id": "S2",
      "parent_id": "U5",
      "author": "madmatias",
      "text": "So you would say that superheroes aren't people anymore? That is a good perspective, and I respect it. A zombie is literally a walking dead, so he is a human, just a dead one. They don't have any working internal organs to lose. Also arguing about this topic is kinda tricky, concidering zombies are little bit different in different stories. But I have to say this is still a fun one",
      "depth": 5
    },
    {
      "id": "U7",
      "speaker_id": "S1",
      "parent_id": "U6",
      "author": "24hourcinderella",
      "text": "Well Batman is still human because he relies on gadgets and suits. His iron will, drive, and intelligence carries him. Someone like The Flash, Aquaman, or Starlord are among those I don't consider human.",
      "depth": 6
    },
    {
      "id": "U8",
      "speaker_id": "S2",
      "parent_id": "U7",
      "author": "madmatias",
      "text": "Wait why don't you consider Starlord a human??",
      "depth": 7
    },
    {
      "id": "U9",
      "speaker_id": "S1",
      "parent_id": "U8",
      "author": "24hourcinderella",
      "text": "His father is an alien god, he may be from Missouri but his father isn't even from earth.",
      "depth": 8
    },
    {
      "id": "U10",
      "speaker_id": "S2",
      "parent_id": "U9",
      "author": "madmatias",
      "text": "If your dad is from, let's say Brazil, and your min is from Italy and you are born in Italy and have the pass of Italy, are you ab Italian?",
      "depth": 9
    },
    {
      "id": "U11",
      "speaker_id": "S2",
      "parent_id": "U7",
      "author": "madmatias",
      "text": "And are we talking about the original story or the movie one?",
      "depth": 7
    },
    {
      "id": "U12",
      "speaker_id": "S1",
      "parent_id": "U11",
      "author": "24hourcinderella",
      "text": "Movie Starlord.",
      "depth": 8
    },
    {
      "id": "U13",
      "speaker_id": "S2",
      "parent_id": "U7",
      "author": "madmatias",
      "text": "And is spiderman a human",
      "depth": 7
    },
    {
      "id": "U14",
      "speaker_id": "S1",
      "parent_id": "U13",
      "author": "24hourcinderella",
      "text": "He's a human. His transformation wasn't as drastic as others.",
      "depth": 8
    },
    {
      "id": "U15",
      "speaker_id": "S2",
      "parent_id": "U14",
      "author": "madmatias",
      "text": "I'd say it's pretty much same as Flash on a scale of changing.",
      "depth": 9
    },
    {
      "id": "U16",
      "speaker_id": "S3",
      "parent_id": "U7",
      "author": "3yaksandadog",
      "text": "You need to understand the biological law of monophilae (an aspect of cladistics) that shoots your argument right between the eyes and doubletaps the sucker;\n\nEven if we become 'something else', evolutionarily speaking, we don't stop being what we were.\n\nWe are more than just Eucaryotes. But we are still eucaryotes.\n\nWe are more than just animals. But we are still animals.\n\nWe are more than just mammals. But we are still mammals.\n\nWe are more than just primates. But we are still primates.\n\nThe flash is a metahuman, but he is still a human.\n\nAtlanteans might be some kind of alien, but I think they're just metahumans. Starlord really is just a human, there doesn't seem to be anything special about him. (His dad might be an alien, but if hes an alien, hes an alien primate animal eucaryote that is genetically compatible with humans. If it walks like a duck and quacks like a duck...)\n\nOnly a creationist would argue against the law of cladistics (because creationism needs 'created kinds' without parent clades, but even those will obey the law of cladistics.\n\nIt goes against all known rules of biology to 'stop being what you are in order to become something else'. Instead you remain what you are, and gain additional adaptions too.\n\nZombies are humans, they're just infected. The definition of human isn't contingent on how many bullets you can wear and keep ticking.\n\n(Edit: This law of monophilae and cladistics is what states as fact that birds are, in fact, dinosaurs, as they don't stop being what their ancestors were)",
      "depth": 7
    },
    {
      "id": "U17",
      "speaker_id": "S4",
      "parent_id": "U16",
      "author": "anotherplatypus",
      "text": "When I was a little kid I spent a day fixated on if tadpoles.  I was like 10, but I'd earned my reptile merit badge in Scouts... \n\nI couldn't understand how tadpole changed from a fish to a frog considering their different evolutionary histories.. it all started because of an issue I had drawing their eyes.  Frogs had vertical slits, but fish eyes were round and without eyelids..... And when did frogs lose their gills?  When they became amphibians... ?  Since frogs layed fish eyes, did they keep the fish reproductive system?  \n\nDid a toad and a fish really love each one day, and that's where tadpoles come from?\n\nYea kids are fucking stupid, but life was hard pre-wikipedia days... I think I called a pet store and asked whatever guy happened to answered the phone... (who also happened to know the answer btw.)\n\nIt blew my mind when I learned that tadpoles are not fish, they're still fucking frogs, albeat in an early phase of their ribbity life cycle.  \n\nFrog eggs are premature frogs, tadpoles are juvenile frogs, adult frogs are adult frogs, and dead frogs are dead frogs.  They're all the same species....\n\nSoooooooo, I think the dead human is a dead human.  And the zombie has a relationship ship with the dead human body.  But it's inhabiting part of the body of a dead human like a hermit crab inhabits a part of a dead mollusk....",
      "depth": 8
    },
    {
      "id": "U18",
      "speaker_id": "S3",
      "parent_id": "U17",
      "author": "3yaksandadog",
      "text": "&gt; \n&gt; Yea kids are fucking stupid,\n\nFuckn' nailed it, Dood.\n\n&gt; But it's inhabiting part of the body of a dead human like a hermit crab\n\nDamn, I like these brilliant, critical, intellectual discussions, you just made a hell of a compelling point.\nI'm going to grant you your premise but split hairs like a good philosopher.\nYour case stands in the scenario of BIOLOGICAL zombies, but not supernatural zombies. Supernatural is magic, so 'don't gotta explain shit', and holds up less to investigation anyway, so is the weaker of the two premise, but this means we have to direct some of our scrutiny at the bio-zombies again instead.\n\nBio zombies are still WEARING the trappings of their meatbag hosts. So, technically, its an evolutionary symbiosis, like single-celled organisms forming colonies (an example that religious fundies REALLY need to grapple with when trying to dismiss evolution), so we'd call them a hybrid organism?",
      "depth": 9
    },
    {
      "id": "U19",
      "speaker_id": null,
      "parent_id": "U18",
      "author": "[deleted]",
      "text": "u/objection-bot",
      "depth": 10
    },
    {
      "id": "U20",
      "speaker_id": "S5",
      "parent_id": "U3",
      "author": "DrRatatouille",
      "text": "Have y’all seen Warm Bodies? The zombies still have human qualities because their still human",
      "depth": 3
    },
    {
      "id": "U21",
      "speaker_id": "S6",
      "parent_id": "U3",
      "author": "Externalkight",
      "text": "I believe you’ve forgotten cannibalism exists my good sir",
      "depth": 3
    },
    {
      "id": "U22",
      "speaker_id": "S7",
      "parent_id": "U2",
      "author": "big_yoshi6969",
      "text": "!objection-bot",
      "depth": 2
    },
    {
      "id": "U23",
      "speaker_id": "S8",
      "parent_id": "U2",
      "author": "TaconicTitan",
      "text": "It's a rotten banana. That would be the equivalent of saying is a dead human still a human. Biologically? Yes. However a human corpse, not a \"person\" per se.",
      "depth": 2
    },
    {
      "id": "U24",
      "speaker_id": "S9",
      "parent_id": "U1",
      "author": "dvachuu",
      "text": "God you’re so retarded and lame. No wonder your gf chose to ignore you XD",
      "depth": 1
    },
    {
      "id": "U25",
      "speaker_id": "S10",
      "parent_id": "U1",
      "author": "bruhntosaur",
      "text": "Yes. Self defense still is a thing tho. The second the hungered for flesh is the second they lost their rights",
      "depth": 1
    },
    {
      "id": "U26",
      "speaker_id": "S11",
      "parent_id": "U1",
      "author": "Hulkman123",
      "text": "Depending on the type of zombies. Some still have thoughts and can talk.\nSome are just infected from a virus or fungus, and progressively become less human.\nExamples like Freakers in days gone are still humans but are more animalistic and stronger than the average person.\nThe last of us. Where the fungus slows takes control of you. First it takes your mobility. Then the fungus grows and you lose all humanity.\n\nIf we’re talking about the night of the living dead type then no, you are just dead. All humanity is snuffed out, along with intelligence.\n\nIf we’re talking about a voodoo cures then you are one hundred percent human. Because you are alive. You’d just be an obedient slave until the curse is lifted.",
      "depth": 1
    },
    {
      "id": "U27",
      "speaker_id": "S12",
      "parent_id": "U1",
      "author": "nothingconspicousher",
      "text": "Salute Lee not.  \nEdit: What is that auto correct",
      "depth": 1
    },
    {
      "id": "U28",
      "speaker_id": "S13",
      "parent_id": "U27",
      "author": "Educational_Tax_7104",
      "text": "Lol",
      "depth": 2
    },
    {
      "id": "U29",
      "speaker_id": "S14",
      "parent_id": "U1",
      "author": "Ok_Elevator6947",
      "text": "I'd say their half human because the still technically resemble a human but their bodies are out of their control",
      "depth": 1
    },
    {
      "id": "U30",
      "speaker_id": "S15",
      "parent_id": "U1",
      "author": "gigglywiggly1232",
      "text": "Physically, they are human. Mentally, they are not. Both are edible.",
      "depth": 1
    },
    {
      "id": "U31",
      "speaker_id": "S5",
      "parent_id": "U30",
      "author": "DrRatatouille",
      "text": "Damn I love human and zombie. Best food out there.\n\nBut…If a human bit a zombie would it do anything?",
      "depth": 2
    },
    {
      "id": "U32",
      "speaker_id": "S16",
      "parent_id": "U1",
      "author": "PAN_cake_103",
      "text": "I'm taking your brothers side here. The zombies are still human. The body rots. It got infected. Mutated. Etc... But it is still the body of a human.\n\nWhat you're referring to is humanity. The emotional and mental side of us. Since that is a part that can be lost. Although many types of zombies still have the human alive, but just controlled.\n\nBesides, I bet you still call a zombified dog a dog.",
      "depth": 1
    },
    {
      "id": "U33",
      "speaker_id": "S5",
      "parent_id": "U1",
      "author": "DrRatatouille",
      "text": "A zombie is a human. In zombie movies sometimes there’s this person who sees their loved one as a zombie and have a mental breakdown. Why would they break down if the zombie isn’t someone they know? Also, the zombie VIRUS is a disease, so like any other disease, the carrier is still human. Someone with cancer isn’t just cancer, their a person.",
      "depth": 1
    },
    {
      "id": "U34",
      "speaker_id": "S17",
      "parent_id": "U1",
      "author": "Tricky_Particular_69",
      "text": "That’s a solid debate! Both of you make good points, but I’d say your argument is stronger. Zombies, by definition, are not fully human anymore. They may have once been human, but the transformation strips away key aspects of what makes someone human—rational thought, self-awareness, and moral decision-making. Even if their bodies remain largely intact, their minds are completely altered, making them something fundamentally different. Your brother’s best argument is that zombies are just “broken” humans, but at some point, the mental and biological changes are so severe that they cross into something new. If they were still human, you wouldn’t call them zombies. So, I’d say you’re right—zombies are no longer human.",
      "depth": 1
    },
    {
      "id": "U35",
      "speaker_id": "S18",
      "parent_id": "U1",
      "author": "WendigoInTheForest",
      "text": "Yes and no. Technically they would be undead so a human in a stage of decomposition, but also unconscious. So half dead, half human",
      "depth": 1
    },
    {
      "id": "U36",
      "speaker_id": "S19",
      "parent_id": "U1",
      "author": "Inner-Carpenter-4774",
      "text": "According to the lore, they aren’t technically human, but they aren’t zombies either. The Autophage occurs after a certain number of generations of humans have cycled through, resulting in a gene change. Therefore they would be mutated/evolved humans. Basically they would no longer be homo sapiens, but more like homo imprudens (as sapiens comes from the latin word for “wise”, imprudens comes from the latin word “unwise”).",
      "depth": 1
    },
    {
      "id": "U37",
      "speaker_id": "S20",
      "parent_id": "U1",
      "author": "WormsInYourSpaghetti",
      "text": "As the Cambridge dictionary suggests, human: \"being, relating to, or belonging to a person or to people as opposed to animals.\" A zombie dies not belong in the category of people, they also mention, \"having the qualities, faults, and feelings that people have, as opposed to gods, animals, or machines\" Typical zombies do not have feelings or many qualities to a human, they are more like an infected animal in a humans point of view. This dictionary also suggests that, \"Zombies are not able to think and they are often shown as attacking and eating human beings.\" This supports the second argument as to become a human you need to have a majority of qualities, feeling and to be able to think. As par the evidence suggests a zombie is not a human and more like a animal going on a rampage.",
      "depth": 1
    },
    {
      "id": "U38",
      "speaker_id": "S21",
      "parent_id": "U1",
      "author": "YoungGuppy602",
      "text": "It’s been a year, any updates?",
      "depth": 1
    },
    {
      "id": "U39",
      "speaker_id": "S22",
      "parent_id": "U1",
      "author": "True-Fire-Senzhi",
      "text": "The dictionary says they are corpses brought back, usually through witchcraft.\n\nThe definition never said they had to be human.",
      "depth": 1
    },
    {
      "id": "U40",
      "speaker_id": "S23",
      "parent_id": "U1",
      "author": "-_i_like_bread_-",
      "text": "Zombies technically are just the undead form of the alive version of that creature. So undead humsns are zombies",
      "depth": 1
    },
    {
      "id": "U41",
      "speaker_id": null,
      "parent_id": "U1",
      "author": "[deleted]",
      "text": "It's still human, heavily altered but still human someone that gets a flu is still human and a rotting corpse is still human just as much as zombies are reanimated humans",
      "depth": 1
    },
    {
      "id": "U42",
      "speaker_id": "S24",
      "parent_id": "U1",
      "author": "sirjoey150",
      "text": "Zombies would still be human. It doesn't change the species, just how they act. At least that's how the common/most popular zomibies (TWD) are portayed.",
      "depth": 1
    },
    {
      "id": "U43",
      "speaker_id": "S25",
      "parent_id": "U1",
      "author": "GuardianDireWolf",
      "text": "Are you talking about humanity or species.",
      "depth": 1
    },
    {
      "id": "U44",
      "speaker_id": "S8",
      "parent_id": "U1",
      "author": "TaconicTitan",
      "text": "Well, if we are to come to a conclusion here, it is necessary to specify what kind of zombie we speak of, infected/viral or undead/reanimated.\n\nI think firstly it's safe to establish that, no matter what kind of zombie we're debating about, killing them is not a moral issue (if that's what your brother was getting at) since they're killing  and infecting everyone else. Unless being a zombie is actually good, in which case all should be converted to zombiism. Less world wars, that's for sure.\n\nAnyways, on to my points:\n\nUndead: okay so when you die, your consciousness is what's dying, your memories... everything that makes you human. Or at least leaving your mortal shell. The body is technically still \"human\" (as in, it's a human corpse) until it rots into dirt, however the mind is either that of the necromancer raising it up or no mind at all, just a flesh-eating organism incapable of human thought and emotion which, ultimately, makes us human. So I think it's safe to say that the Undead are no longer \"human\" as such, simply human bodies or corpses.\n\nInfected: Again, same basic principle; the body is human, but the mind/consciousness/\"soul\"/essence of the person no longer resides, leaving it just a shell of a human inhabited by some viral infection which is using the body as a host. There is also (as far as I know) no condition that those considered \"human\" have that exhibits zombie-like tendencies. No emotion, no reasoning or thought, perhaps even more stupid than animals. I don't think it's fair to call these zombies human either.\n\nThe only exception I'd say is Shaun of the Dead, where dead Nick Frost still plays videogames with Simon Pegg. He's more just had a paradigm shift into a cannibalistic sociopath, but definitely still human ;)",
      "depth": 1
    },
    {
      "id": "U45",
      "speaker_id": "S13",
      "parent_id": "U1",
      "author": "Educational_Tax_7104",
      "text": "Yes, just its undead counterpart.",
      "depth": 1
    },
    {
      "id": "U46",
      "speaker_id": "S26",
      "parent_id": "U1",
      "author": "Maximum-Progress3736",
      "text": "This reminded me of tha one walking dead scene where hershel and Shane got into it because he was keeping walkers in the barn and said he thought they were alive then Shane goes and puts three rounds in the walker then finally killing it two diff people entirely I'm on the side where I think tha once they turned they aren't human they're the dead reanimated they don't have a soul which makes a human well human and they can't exactly use their brain plus in most shows/games/movies I noticed that they have to die first before turning therefore jus making them dead, zombies are jus a walking ball of rotting flesh craving and endless hunger sure they were once human but anything tha lives after death imo isnt a human no longer, they're also missing many qualities that make a human, human, such as emotion, and other qualities etc.",
      "depth": 1
    },
    {
      "id": "U47",
      "speaker_id": "S27",
      "parent_id": "U1",
      "author": "Aviestol",
      "text": "Nah way man, the world is the zombie and we are living in it. I mean like, you need a brain to function in this world. You give your thoughts and time thinking about the world, I.e your donating your brains precious time to the world. World = Zombie",
      "depth": 1
    }
  ]
}